DiplomD/src/Catalogs/Группы/Группы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Группы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кафедра</name>
    <type>
      <types>CatalogRef.Кафедры</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбразовательнаяПрограмма</name>
    <type>
      <types>CatalogRef.ОбразовательныеПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
</mdclass:Catalog>

DiplomD/src/Catalogs/Кафедры/Кафедры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кафедры</name>
  <attributes>
    <name>НомерКабинета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаведующийКафедрой</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйМетодист</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПреподавательскийСостав</name>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусПреподавателя</name>
      <type>
        <types>CatalogRef.ДолжностиПреподавательскогоСостава</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрофилиНаправления</name>
    <attributes>
      <name>Профиль</name>
      <type>
        <types>CatalogRef.ПрофилиНаправления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

DiplomD/src/Catalogs/Группы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура КураторПриИзмененииНаСервере()
	Спр= Справочники.ПреподавательскийСостав.НайтиПоНаименованию(Объект.Куратор); 
	Если НЕ Спр.Кафедра = Объект.Кафедра Тогда 
		Сообщить("Выбранный преподаватель не относится к кафедре" + " " + Объект.Кафедра); 
		Объект.Куратор = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КураторПриИзменении(Элемент)
	КураторПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КафедраПриИзмененииНаСервере()
	Спр = Справочники.Кафедры.НайтиПоНаименованию(Объект.Кафедра); 
	Если НЕ Спр.Факультет = Объект.Факультет Тогда 
		Сообщить("Выбранная кафедра не относится к факультету" + " " + Объект.Факультет); 
		Объект.Кафедра = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КафедраПриИзменении(Элемент)
	КафедраПриИзмененииНаСервере();
КонецПроцедуры
